<?php
$logo_image = get_theme_mod('sp_logo_setting');
?>
<div class="header-fixnav-sp">
  <div class="header-fixnav-sp-block">
    <div class="header-fixnav-sp__logo">
      <a href="<?php echo home_url(); ?>" class="header-fixnav-sp__link">
        <?php if ($logo_image) : ?>
          <img src="<?php echo esc_url($logo_image); ?>" class="header-fixnav-sp__img" width="150" height="auto" alt="中央福祉葬祭">
        <?php endif; ?>
      </a>
    </div>
    <div class="header-fixnav-sp__nav">
      <div class="header-content-sp__square">
        <a href="<?php echo home_url(); ?>/chuou-fukushi/#anchi">
          <span class="square_block">
            安置室<br>完備
          </span>
        </a>
      </div>
      <nav>
        <ul class="header-fixnav-sp-list">
          <li class="header-content-sp-item item_menu">
            <span id="btn-menu-open" class="header-content-sp__link">
              <svg class="menu_open" width="20" height="14" viewBox="0 0 20 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path id="Vector" d="M1.11111 13.3333H18.8889C19.5 13.3333 20 12.8333 20 12.2222C20 11.6111 19.5 11.1111 18.8889 11.1111H1.11111C0.5 11.1111 0 11.6111 0 12.2222C0 12.8333 0.5 13.3333 1.11111 13.3333ZM1.11111 7.77778H18.8889C19.5 7.77778 20 7.27778 20 6.66667C20 6.05556 19.5 5.55556 18.8889 5.55556H1.11111C0.5 5.55556 0 6.05556 0 6.66667C0 7.27778 0.5 7.77778 1.11111 7.77778ZM0 1.11111C0 1.72222 0.5 2.22222 1.11111 2.22222H18.8889C19.5 2.22222 20 1.72222 20 1.11111C20 0.5 19.5 0 18.8889 0H1.11111C0.5 0 0 0.5 0 1.11111Z" fill="#333333"></path>
              </svg>
              <svg class="menu_close" width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g clip-path="url(#clip0_44_3592)">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M9.99996 11.7675L14.4191 16.1875C14.6536 16.422 14.9717 16.5537 15.3033 16.5537C15.6349 16.5537 15.953 16.422 16.1875 16.1875C16.422 15.953 16.5537 15.635 16.5537 15.3033C16.5537 14.9717 16.422 14.6537 16.1875 14.4192L11.7666 10L16.1866 5.58083C16.3027 5.46472 16.3947 5.32689 16.4575 5.17521C16.5203 5.02352 16.5526 4.86096 16.5526 4.69679C16.5525 4.53262 16.5202 4.37007 16.4573 4.21842C16.3944 4.06676 16.3023 3.92897 16.1862 3.81292C16.0701 3.69686 15.9323 3.60481 15.7806 3.54202C15.6289 3.47924 15.4663 3.44694 15.3022 3.44698C15.138 3.44702 14.9754 3.47939 14.8238 3.54225C14.6721 3.60511 14.5343 3.69722 14.4183 3.81333L9.99996 8.2325L5.58079 3.81333C5.46554 3.69389 5.32765 3.5986 5.17518 3.53302C5.0227 3.46744 4.85869 3.43288 4.69272 3.43136C4.52675 3.42984 4.36213 3.46139 4.20849 3.52417C4.05484 3.58694 3.91523 3.67969 3.79781 3.797C3.68039 3.91431 3.58751 4.05384 3.52458 4.20743C3.46166 4.36102 3.42995 4.5256 3.43132 4.69157C3.43268 4.85755 3.46708 5.02159 3.53252 5.17412C3.59796 5.32666 3.69312 5.46464 3.81245 5.58L8.23329 10L3.81329 14.4192C3.57879 14.6537 3.44705 14.9717 3.44705 15.3033C3.44705 15.635 3.57879 15.953 3.81329 16.1875C4.04778 16.422 4.36583 16.5537 4.69746 16.5537C5.02908 16.5537 5.34713 16.422 5.58162 16.1875L9.99996 11.7667V11.7675Z" fill="white"></path>
                </g>
                <defs>
                  <clipPath id="clip0_44_3592">
                    <rect width="20" height="20" fill="white"></rect>
                  </clipPath>
                </defs>
              </svg>
              メニュー
            </span>
          </li>
        </ul>
      </nav>
    </div>
  </div>
</div>